In [7]:
import pandas as pd

# Load the data into a pandas DataFrame
df = pd.read_csv("data-Copy1.tsv", delimiter="\t")

In [8]:
df.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [10]:
# Remove any duplicate rows from the DataFrame
df = df.drop_duplicates()

# Replace any missing values in the "directors" column with "unknown"
df["directors"].fillna("unknown", inplace=True)

# Replace any missing values in the "writers" column with "unknown"
df["writers"].fillna("unknown", inplace=True)

# Remove any rows where the "tconst" column is missing
df = df[df["tconst"].notna()]

# Export the cleaned data to a new CSV file
#df.to_csv("cleaned-title.crew2.csv", index=False)

In [11]:
df.head()

      tconst  directors writers
0  tt0000001  nm0005690      \N
1  tt0000002  nm0721526      \N
2  tt0000003  nm0721526      \N
3  tt0000004  nm0721526      \N
4  tt0000005  nm0005690      \N

In [14]:

# Write the DataFrame to a new .csv file
df.to_csv("converted_file.csv", index=False)

In [5]:
import csv

with open("crew.csv", "r") as file:
    reader = csv.reader(file)
    header = next(reader)
    rows = [row for row in reader if row[0] != "/N" and row[0] != "0"]

with open("crew.csv", "w", newline="") as file:
    writer = csv.writer(file)
    writer.writerow(header)
    writer.writerows(rows)

In [10]:
import pandas as pd

# Load the data into a pandas dataframe
df = pd.read_csv("crew.csv")

# Drop rows with "\N" value
df.drop(df[df["directors"] == "\\N"].index, inplace=True)
#df.drop(df[df["column_name"] == "\\N"].index, inplace=True)

# Save the updated dataframe to a csv file
#df.to_csv("data-2-clean.csv", index=False)

In [11]:
df.head()

      tconst      directors writers
0  tt0000001  ['nm0005690']      \N
1  tt0000002  ['nm0721526']      \N
2  tt0000003  ['nm0721526']      \N
3  tt0000004  ['nm0721526']      \N
4  tt0000005  ['nm0005690']      \N

In [14]:
df.drop(df[df["writers"] == "\\N"].index, inplace=True)

In [15]:
df.head()

        tconst      directors    writers
8    tt0000009  ['nm0085156']  nm0085156
34   tt0000036  ['nm0005690']  nm0410331
74   tt0000076  ['nm0005690']  nm0410331
89   tt0000091  ['nm0617588']  nm0617588
106  tt0000108  ['nm0005690']  nm0410331

In [17]:
grouped = df.groupby('tconst').agg({ 'directors': ', '.join,
                                     'writers': ', '.join})

In [18]:
df.head()

        tconst      directors    writers
8    tt0000009  ['nm0085156']  nm0085156
34   tt0000036  ['nm0005690']  nm0410331
74   tt0000076  ['nm0005690']  nm0410331
89   tt0000091  ['nm0617588']  nm0617588
106  tt0000108  ['nm0005690']  nm0410331

In [19]:
df.to_csv("NewCrew.csv", index=False)